OpenFOAM/libAcoustics/libAcoustics-OF3.0.0/cases/tandem-274k-1/0/U-time
uniformValue table
3
(
    (0.00 ( 0 0 0))
    (0.01 (40 0 0))
    (9.99 (40 0 0))
);



